import random

def first():
    n = int(input("Введите кол-во элементов списка: "))
    x = int(input("Введите начальный элемент: "))
    a = []
    a.append(x)

    for i in range(0, n):
        x = x + 1
        a.append(x)
    print("Список:", a)

def second():
    n = int(input("Введите кол-во элементов списка: "))
    a = int(input("Введите начальный элемент: "))
    b = int(input("Введите конечный элемент: "))
    x = []
    count = 0
    for i in range(0, n):
        x.append(random.randint(a, b))
        if 999>x[i]>100 and x[i] % 5 != 0:
            count += 1
    print("Список:", x)
    print("Трехзнычные числа, которые не деляться на 5", count)

def third():
    n = int(input("Введите кол-во элементов списка: "))
    a = int(input("Введите начальный элемент: "))
    b = int(input("Введите конечный элемент: "))
    k = int(input("Введите число: "))
    x = []
    count = 0
    for i in range(0, n):
        x.append(random.randint(a, b))
        if sum(map(int, list(str(i)))) == k:
            count += 1
    print("Список:", x)
    print("Элементы у которых сумма цифр равна k:", count)

def fourth():
    n = int(input("Введите кол-во элементов списка: "))
    a = int(input("Введите начальный элемент: "))
    b = int(input("Введите конечный элемент: "))
    x = []
    c = []
    for i in range(0, n):
        x.append(random.randint(a, b))
        if x[i]%2 == 0:
            c.append(x[i])
    print("Список:", x)
    print("Максимальный четный элемент в списке:", max(c))

def fifth():
    n = int(input("Введите кол-во элементов списка: "))
    a = int(input("Введите начальный элемент: "))
    b = int(input("Введите конечный элемент: "))
    x = []
    c = []
    d = []
    for i in range(0, n):
        x.append(random.randint(a, b))
        if x[i]<=50:
            c.append(x[i])
        elif x[i]>50:
            d.append(x[i])
     
    print("Список:", x)
    print("Среднее арифметическое элементов <50:", sum(c)/len(c))
    print("Среднее арифметическое элементов >50:", sum(d)/len(d))

def sixth():
    n = int(input("Введите кол-во элементов списка: "))
    a = int(input("Введите начальный элемент: "))
    b = int(input("Введите конечный элемент: "))
 
    nums = [random.randint(a, b) for _ in range(n)]
 
    idx = [0,1]
    minsum = nums[0]+nums[1]
 
    for i in range(1, n-1):
        if (nums[i] + nums[i+1]) <= minsum:
            minsum = nums[i] + nums[i+1]
            idx = [i, i+1]
 
    print("Минимальная пара чисел:", idx)

def seventh():
    a, b, c = map(int, input("Введите числа(a, b, n) через пробел: ").split())
    h = []
    g = [0,0]
    for i in range(c):
       h.append(random.randint(a,b))
    s = abs(h[0] - h[1])
    for i in range(c):
        for j in range(i+1, c):
            if abs(h[i] - h[j]) <= s:
                 g[0] = i + 1
                 g[1] = j + 1
                 s = abs(h[i] - h[j])
    g.sort()
    print(*h,sep = ' ')
    print("Ближайшие числа:", *g, sep = ' ')
    
def eighth():
    size = int(input("Введите размер массива: "))
    data = input("Введите значения массива: ")
    new = [i for i in data if data.count(i) > 1 and i != " "]
    result = []
    for i in new:
        if i not in result:
            result.append(i)
            print(int(i), end = " ")
        if len(result) == 0: print(0)

def ninth():
    s = (2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293,)
    n = int(input("Введите кол-во элементов списка: "))
    a = int(input("Введите начальный элемент: "))
    b = int(input("Введите конечный элемент: "))
    x = []
    y = []
    for i in range(0, n):
        x.append(random.randint(a, b))
        if x[i] in s:
            y.append(x[i])
    print("Список:", x)
    print("Список простых чисел: ", y)
    

def tenth():
    s = (0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418, 317811, 514229, 832040, 1346269, 2178309, 3524578, 5702887, 9227465, 14930352, 24157817, 39088169, 63245986, 102334155, 165580141, 267914296, 433494437, 701408733, 1134903170, 1836311903, 2971215073, 4807526976, 7778742049, 12586269025, 20365011074, 32951280099, 53316291173, 86267571272, 139583862445, 225851433717, 365435296162, 591286729879, 956722026041, 1548008755920, 2504730781961, 4052739537881, 6557470319842, 10610209857723, 17167680177565, 27777890035288, 44945570212853, 72723460248141, 117669030460994, 190392490709135, 308061521170129, 498454011879264, 806515533049393, 1304969544928657, 2111485077978050, 3416454622906707, 5527939700884757, 8944394323791464, 14472334024676221, 23416728348467685, 37889062373143906, 61305790721611591, 99194853094755497, 160500643816367088, 259695496911122585, 420196140727489673, 679891637638612258, 1100087778366101931, 1779979416004714189, 2880067194370816120, 4660046610375530309, 7540113804746346429, 12200160415121876738, 19740274219868223167, 31940434634990099905, 51680708854858323072, 83621143489848422977, 135301852344706746049, 218922995834555169026)
    c = int(input("введите число: "))
    m2 = []
    a = list(map(int, input("Введите числа для массива: ").split()))
    for i in a:
        if i in s:
            m2.append(i)
    if len(m2) == 0:
        print(0)
    else:
        print("Числа Фиббоначи: " + " ".join(str(x) for x in m2))
    
